{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batchInputShape": [null, 128, 128, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "activation": "relu",
              "dtype": "float32"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "pool_size": [2, 2],
              "strides": [2, 2],
              "dtype": "float32"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "activation": "relu",
              "dtype": "float32"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "pool_size": [2, 2],
              "strides": [2, 2],
              "dtype": "float32"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "units": 128,
              "activation": "relu",
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "rate": 0.4,
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "units": 4,
              "activation": "softmax",
              "dtype": "float32"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "sequential/conv2d/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d_1/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d_1/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense/kernel",
          "shape": [16384, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_1/kernel",
          "shape": [128, 4],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_1/bias",
          "shape": [4],
          "dtype": "float32"
        }
      ]
    }
  ]
}
